
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ИзменяемаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если Год(ИзменяемаяСтрока.ДатаНачала) <> Объект.Год Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В строке №: " + ИзменяемаяСтрока.НомерСтроки + " выбранная дата, не соответствует указанному году! Поменяйте дату!";
		Сообщение.Поле = "Объект.ОтпускаСотрудников[" + (ИзменяемаяСтрока.НомерСтроки -1) + "].ДатаНачала";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
		ИзменяемаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
		
	Если Год(ИзменяемаяСтрока.ДатаОкончания) <> Объект.Год Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В строке №: " + ИзменяемаяСтрока.НомерСтроки + " выбранная дата, не соответствует указанному году. Поменяйте дату!";
		Сообщение.Поле = "Объект.ОтпускаСотрудников[" + (ИзменяемаяСтрока.НомерСтроки -1) + "].ДатаОкончания";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПревышениеОтпуска(Команда)
	
	ПроверитьПревышениеОтпускаНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГрафик(Команда) 
	
	ПараметрыВвода = Новый Структура;
	ПараметрыВвода.Вставить("Дата", Объект.Дата);
	ПараметрыВвода.Вставить("Год", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыВвода, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПревышениеОтпускаНаСервере()
	
	Дата = Дата(Объект.Год, Месяц(Объект.Дата), День(Объект.Дата));
	
	УсловноеОформление.Элементы.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОбороты.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ГрафикОтпусковОбороты.ДнейОтпускаОборот) КАК ДнейОтпуска
	|ИЗ
	|	РегистрНакопления.ВКМ_ГрафикОтпусков.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ГрафикОтпусковОбороты
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОбороты.ДнейОтпускаОборот > 28
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ГрафикОтпусковОбороты.Сотрудник";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецГода(Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
			
	Пока Выборка.Следующий() Цикл
		
		ЭлементОформленияЛосось = УсловноеОформление.Элементы.Добавить();
		ЭлементОформленияЛосось.Использование = Истина;
		ЭлементОформленияЛосось.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.ЛососьСветлый);
				
		ЭлементУсловияЛосось = ЭлементОформленияЛосось.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловияЛосось.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
		ЭлементУсловияЛосось.ПравоеЗначение =  Выборка.Сотрудник;
		ЭлементУсловияЛосось.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловияЛосось.Использование = Истина;
		
	
		ОформляемоеПоле = ЭлементОформленияЛосось.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти




