
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
			Объект.ДатаПроведенияРабот = Параметры.Дата;
			Объект.ВремяНачалаРабот = Параметры.ВремяНачалаРабот;
			Объект.ВремяОкончанияРабот = Параметры.ВремяОкончанияРабот;
			Объект.Специалист = Параметры.Специалист;		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Документ Обслуживание клинтов записан");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот КАК ВремяОкончанияРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Объект.Специалист <> Выборка.Специалист Тогда
			Специалист  = Объект.Специалист;
		Иначе
			Специалист = Выборка.Специалист;
		КонецЕсли;
		
		Если Объект.ДатаПроведенияРабот <> Выборка.ДатаПроведенияРабот Тогда
			ДатаПроведенияРабот = Объект.ДатаПроведенияРабот;
		Иначе
			ДатаПроведенияРабот = Выборка.ДатаПроведенияРабот;
		КонецЕсли;
		
		Если Объект.ВремяНачалаРабот <> Выборка.ВремяНачалаРабот Тогда
			ВремяНачалаРабот = Объект.ВремяНачалаРабот;
		Иначе
			ВремяНачалаРабот = Выборка.ВремяНачалаРабот;
		КонецЕсли;
		
		Если Объект.ВремяОкончанияРабот <> Выборка.ВремяОкончанияРабот Тогда   
			ВремяОкончанияРабот = Объект.ВремяОкончанияРабот;
		Иначе
			ВремяОкончанияРабот = Выборка.ВремяОкончанияРабот;
		КонецЕсли;
			 		
	КонецЦикла;
	
    НовоеСообщение(Специалист, ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НовоеСообщение(Специалист, ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот)
			
	Если Параметры.Ключ.Пустая() Тогда 
		Возврат;
	КонецЕсли;
	
	НовоеСообщение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеСообщение.ТекстСообщения = СтрШаблон("Внимание! По Заявке № %1, Клиент: %2,внесены изменения. Дата проведения работ: %3. Время начала: %4. Время окончания: %5. Специалист: %6",
							Объект.Клиент,
							Объект.Номер, 
							Формат(ДатаПроведенияРабот,"ДФ=dd.MM.yyyy"), 
							Формат(ВремяНачалаРабот,"ДЛФ=T"), 
							Формат(ВремяОкончанияРабот, "ДЛФ=T"), 
							Специалист);
	
	НовоеСообщение.Записать();
		
КонецПроцедуры

#КонецОбласти



